import os

import os
import sys

if getattr(sys, "frozen", False):
    # 打包后的 exe 环境
    脚本目录 = os.path.dirname(sys.executable)
else:
    # 开发环境
    脚本目录 = os.path.dirname(os.path.abspath(__file__))

图片目录 = os.path.join(脚本目录, "images")

置信度 = 0.99
窗口标题 = "悠久之树"
步骤等待 = 1.2

任务流文件 = os.path.join(脚本目录, "tasks.json")

页面表 = {
    "主界面": {
        "标识": "出击.png",
        "可点击": {"出击": "出击.png"},
        "跳转": {"出击": "类别页"},
    },
    "导览类别页": {
        "标识": "导览_2.png",
        "可点击": {
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "主线类别页": {
        "标识": "主线_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "素材类别页":{
        "标识":"素材_2.png",
        "可点击": {
            "角色回响":"素材_角色回响.png",
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "角色回响":"角色回响经验列表页",
            "导览": "导览类别页",
            "主线": "主线类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "挑战类别页": {
        "标识": "挑战_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "限时类别页": {
        "标识": "限时_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "常驻类别页": {
        "标识": "常驻_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
        },
    },
    "契约类别页": {
        "标识": "契约_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "多人": "多人_1.png",
            "高难": "高难_1.png",
            "桃源": "桃源.png",
            "神眠": "神眠.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "多人": "多人类别页",
            "高难": "高难类别页",
            "桃源": "桃源副本列表页",
            "神眠": "神眠副本列表页",
        },
    },
    "多人类别页": {
        "标识": "多人_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "高难": "高难_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "高难": "高难类别页",
        },
    },
    "高难类别页": {
        "标识": "高难_2.png",
        "可点击": {
            "导览": "导览_1.png",
            "主线": "主线_1.png",
            "素材": "素材_1.png",
            "挑战": "挑战_1.png",
            "限时": "限时_1.png",
            "常驻": "常驻_1.png",
            "契约": "契约_1.png",
            "多人": "多人_1.png",
        },
        "跳转": {
            "导览": "导览类别页",
            "主线": "主线类别页",
            "素材": "素材类别页",
            "挑战": "挑战类别页",
            "限时": "限时类别页",
            "常驻": "常驻类别页",
            "契约": "契约类别页",
            "多人": "多人类别页",
        },
    },
    "桃源副本列表页": {
        "标识": "桃源主界面标识.png",
        "可点击": {
            "腾蛇": "桃源_腾蛇.png",
            "勾陈": "桃源_勾陈.png",
            "青龙": "桃源_青龙.png",
            "白虎": "桃源_白虎.png",
            "朱雀": "桃源_朱雀.png",
            "玄武": "桃源_玄武.png",
        },
        "跳转": {
            "腾蛇": "腾蛇关卡列表页",
            "勾陈": "勾陈关卡列表页",
            "青龙": "青龙关卡列表页",
            "白虎": "白虎关卡列表页",
            "朱雀": "朱雀关卡列表页",
            "玄武": "玄武关卡列表页",
        },
    },
    "神眠副本列表页": {
        "标识": "神眠主界面标识.png",
        "可点击": {
            "光神眠": "神眠_光.png",
            "暗神眠": "神眠_暗.png",
            "地神眠": "神眠_地.png",
            "水神眠": "神眠_水.png",
            "火神眠": "神眠_火.png",
            "风神眠": "神眠_风.png",
        },
        "跳转": {
            "光神眠": "光神眠关卡列表页",
            "暗神眠": "暗神眠关卡列表页",
            "地神眠": "地神眠关卡列表页",
            "水神眠": "水神眠关卡列表页",
            "火神眠": "火神眠关卡列表页",
            "风神眠": "风神眠关卡列表页",
        },
    },
    "角色回响经验列表页":{
        "标识": "角色回响经验列表页标识.png",
        "可点击":{
            "角色经验4":"素材_角色回响_角色经验.png"
        },
        "跳转":{
            "角色经验4":"角色经验4详情页"
        },
    },
    "角色经验4详情页":{
        "标识": "素材_角色经验4.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    #=========================================
    #勾陈
    "勾陈关卡列表页": {
        "标识": "桃源勾陈界面标识.png",
        "可点击": {
            "关卡1": "桃源_勾陈_1.png",
            "关卡2": "桃源_勾陈_2.png",
        },
        "跳转": {
            "关卡1": "勾陈关卡1难度选择页",
            "关卡2": "勾陈关卡2难度选择页"
        },
    },
    "勾陈关卡1难度选择页": {
        "标识": "桃源_勾陈_1_标识.png",
        "可点击": {
            "难度4": "桃源_勾陈_1_4.png",
        },
        "跳转": {"难度4": "勾陈1_4详情页"},
    },
    "勾陈1_4详情页": {
        "标识": "桃源勾陈1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "勾陈关卡2难度选择页": {
        "标识": "桃源_勾陈_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    #=========================================
    #腾蛇
    "腾蛇关卡列表页": {
        "标识": "桃源腾蛇界面标识.png",
        "可点击": {
            "关卡1": "桃源_腾蛇_1.png",
            "关卡2": "桃源_腾蛇_2.png",
        },
        "跳转": {"关卡1": "腾蛇关卡1难度选择页",
                 "关卡2": "腾蛇关卡2难度选择页"},
    },
    "腾蛇关卡1难度选择页": {
        "标识": "桃源_腾蛇_1_标识.png",
        "可点击": {
            "难度4": "桃源_腾蛇_1_4.png",
        },
        "跳转": {"难度4": "腾蛇1_4详情页"},
    },
    "腾蛇1_4详情页": {
        "标识": "桃源腾蛇1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "腾蛇关卡2难度选择页": {
        "标识": "桃源_腾蛇_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 青龙
    "青龙关卡列表页": {
        "标识": "桃源青龙界面标识.png",
        "可点击": {
            "关卡1": "桃源_青龙_1.png",
            "关卡2": "桃源_青龙_2.png",
        },
        "跳转": {"关卡1": "青龙关卡1难度选择页",
                 "关卡2": "青龙关卡2难度选择页"},
    },
    "青龙关卡1难度选择页": {
        "标识": "桃源_青龙_1_标识.png",
        "可点击": {
            "难度4": "桃源_青龙_1_4.png",
        },
        "跳转": {"难度4": "青龙1_4详情页"},
    },
    "青龙1_4详情页": {
        "标识": "桃源青龙1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "青龙关卡2难度选择页": {
        "标识": "桃源_青龙_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 白虎
    "白虎关卡列表页": {
        "标识": "桃源白虎界面标识.png",
        "可点击": {
            "关卡1": "桃源_白虎_1.png",
            "关卡2": "桃源_白虎_2.png",
        },
        "跳转": {"关卡1": "白虎关卡1难度选择页",
                 "关卡2": "白虎关卡2难度选择页"},
    },
    "白虎关卡1难度选择页": {
        "标识": "桃源_白虎_1_标识.png",
        "可点击": {
            "难度4": "桃源_白虎_1_4.png",
        },
        "跳转": {"难度4": "白虎1_4详情页"},
    },
    "白虎1_4详情页": {
        "标识": "桃源白虎1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "白虎关卡2难度选择页": {
        "标识": "桃源_白虎_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 朱雀
    "朱雀关卡列表页": {
        "标识": "桃源朱雀界面标识.png",
        "可点击": {
            "关卡1": "桃源_朱雀_1.png",
            "关卡2": "桃源_朱雀_2.png",
        },
        "跳转": {"关卡1": "朱雀关卡1难度选择页",
                 "关卡2": "朱雀关卡2难度选择页"},
    },
    "朱雀关卡1难度选择页": {
        "标识": "桃源_朱雀_1_标识.png",
        "可点击": {
            "难度4": "桃源_朱雀_1_4.png",
        },
        "跳转": {"难度4": "朱雀1_4详情页"},
    },
    "朱雀1_4详情页": {
        "标识": "桃源朱雀1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "朱雀关卡2难度选择页": {
        "标识": "桃源_朱雀_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 玄武
    "玄武关卡列表页": {
        "标识": "桃源玄武界面标识.png",
        "可点击": {
            "关卡1": "桃源_玄武_1.png",
            "关卡2": "桃源_玄武_2.png",
        },
        "跳转": {"关卡1": "玄武关卡1难度选择页",
                 "关卡2": "玄武关卡2难度选择页"},
    },
    "玄武关卡1难度选择页": {
        "标识": "桃源_玄武_1_标识.png",
        "可点击": {
            "难度4": "桃源_玄武_1_4.png",
        },
        "跳转": {"难度4": "玄武1_4详情页"},
    },
    "玄武1_4详情页": {
        "标识": "桃源玄武1_4标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "玄武关卡2难度选择页": {
        "标识": "桃源_玄武_2_标识.png",
        "可点击": {
            "扫荡": "桃源_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 光神眠
    "光神眠关卡列表页": {
        "标识": "光神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_光_1.png",
            "关卡2": "神眠_光_2.png",
        },
        "跳转": {"关卡1": "光神眠关卡1难度选择页",
                 "关卡2": "光神眠关卡2难度选择页"},
    },
    "光神眠关卡1难度选择页": {
        "标识": "神眠_光_1_标识.png",
        "可点击": {
            "难度3": "神眠_光_1_3.png",
        },
        "跳转": {"难度3": "光神眠1_3详情页"},
    },
    "光神眠1_3详情页": {
        "标识": "光神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "光神眠关卡2难度选择页": {
        "标识": "神眠_光_2_标识.png",
        "可点击": {
            "难度7": "神眠_光_2_7.png",
        },
        "跳转": {"难度7": "光神眠2_7详情页"},
    },
    "光神眠2_7详情页": {
        "标识": "光神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 暗神眠
    "暗神眠关卡列表页": {
        "标识": "暗神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_暗_1.png",
            "关卡2": "神眠_暗_2.png",
        },
        "跳转": {"关卡1": "暗神眠关卡1难度选择页",
                 "关卡2": "暗神眠关卡2难度选择页"},
    },
    "暗神眠关卡1难度选择页": {
        "标识": "神眠_暗_1_标识.png",
        "可点击": {
            "难度3": "神眠_暗_1_3.png",
        },
        "跳转": {"难度3": "暗神眠1_3详情页"},
    },
    "暗神眠1_3详情页": {
        "标识": "暗神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "暗神眠关卡2难度选择页": {
        "标识": "神眠_暗_2_标识.png",
        "可点击": {
            "难度7": "神眠_暗_2_7.png",
        },
        "跳转": {"难度7": "暗神眠2_7详情页"},
    },
    "暗神眠2_7详情页": {
        "标识": "暗神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 地神眠
    "地神眠关卡列表页": {
        "标识": "地神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_地_1.png",
            "关卡2": "神眠_地_2.png",
        },
        "跳转": {"关卡1": "地神眠关卡1难度选择页",
                 "关卡2": "地神眠关卡2难度选择页"},
    },
    "地神眠关卡1难度选择页": {
        "标识": "神眠_地_1_标识.png",
        "可点击": {
            "难度3": "神眠_地_1_3.png",
        },
        "跳转": {"难度3": "地神眠1_3详情页"},
    },
    "地神眠1_3详情页": {
        "标识": "地神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "地神眠关卡2难度选择页": {
        "标识": "神眠_地_2_标识.png",
        "可点击": {
            "难度7": "神眠_地_2_7.png",
        },
        "跳转": {"难度7": "地神眠2_7详情页"},
    },
    "地神眠2_7详情页": {
        "标识": "地神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 水神眠
    "水神眠关卡列表页": {
        "标识": "水神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_水_1.png",
            "关卡2": "神眠_水_2.png",
        },
        "跳转": {"关卡1": "水神眠关卡1难度选择页",
                 "关卡2": "水神眠关卡2难度选择页"},
    },
    "水神眠关卡1难度选择页": {
        "标识": "神眠_水_1_标识.png",
        "可点击": {
            "难度3": "神眠_水_1_3.png",
        },
        "跳转": {"难度3": "水神眠1_3详情页"},
    },
    "水神眠1_3详情页": {
        "标识": "水神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "水神眠关卡2难度选择页": {
        "标识": "神眠_水_2_标识.png",
        "可点击": {
            "难度7": "神眠_水_2_7.png",
        },
        "跳转": {"难度7": "水神眠2_7详情页"},
    },
    "水神眠2_7详情页": {
        "标识": "水神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 火神眠
    "火神眠关卡列表页": {
        "标识": "火神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_火_1.png",
            "关卡2": "神眠_火_2.png",
        },
        "跳转": {"关卡1": "火神眠关卡1难度选择页",
                 "关卡2": "火神眠关卡2难度选择页"},
    },
    "火神眠关卡1难度选择页": {
        "标识": "神眠_火_1_标识.png",
        "可点击": {
            "难度3": "神眠_火_1_3.png",
        },
        "跳转": {"难度3": "火神眠1_3详情页"},
    },
    "火神眠1_3详情页": {
        "标识": "火神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "火神眠关卡2难度选择页": {
        "标识": "神眠_火_2_标识.png",
        "可点击": {
            "难度7": "神眠_火_2_7.png",
        },
        "跳转": {"难度7": "火神眠2_7详情页"},
    },
    "火神眠2_7详情页": {
        "标识": "火神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 风神眠
    "风神眠关卡列表页": {
        "标识": "风神眠界面标识.png",
        "可点击": {
            "关卡1": "神眠_风_1.png",
            "关卡2": "神眠_风_2.png",
        },
        "跳转": {"关卡1": "风神眠关卡1难度选择页",
                 "关卡2": "风神眠关卡2难度选择页"},
    },
    "风神眠关卡1难度选择页": {
        "标识": "神眠_风_1_标识.png",
        "可点击": {
            "难度3": "神眠_风_1_3.png",
        },
        "跳转": {"难度3": "风神眠1_3详情页"},
    },
    "风神眠1_3详情页": {
        "标识": "风神眠难度3标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    "风神眠关卡2难度选择页": {
        "标识": "神眠_风_2_标识.png",
        "可点击": {
            "难度7": "神眠_风_2_7.png",
        },
        "跳转": {"难度7": "风神眠2_7详情页"},
    },
    "风神眠2_7详情页": {
        "标识": "风神眠难度7标识.png",
        "可点击": {
            "扫荡": "神眠_扫荡.png",
        },
        "跳转": {"扫荡": "扫荡确认弹窗"},
    },
    # =========================================
    # 扫荡界面
    "扫荡确认弹窗": {
        "标识": "桃源_扫荡后确定.png",
        "可点击": {
            "确定": "桃源_扫荡后确定.png",
        },
        "跳转": {"确定": "扫荡结算页"},
    },
    "扫荡结算页": {
        "标识": "桃源_再次扫荡.png",
        "可点击": {
            "再次扫荡": "桃源_再次扫荡.png",
            "确定": "桃源_扫荡结束确认.png",
        },
        "跳转": {"确定": "返回主界面"},
    },
    "返回主界面":{
        "标识": "返回主界面.png",
        "可点击": {
            "返回": "返回主界面.png",
        },
        "跳转": {"返回":"主界面"},
    }
}

流程表 = {
    # =========================================
    # 勾陈
    "桃源_勾陈_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "勾陈关卡列表页",
            "勾陈关卡1难度选择页",
            "勾陈1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡结束确认.png",
    },
    "桃源_勾陈_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "勾陈关卡列表页",
            "勾陈关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 腾蛇
    "桃源_腾蛇_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "腾蛇关卡列表页",
            "腾蛇关卡1难度选择页",
            "腾蛇1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "桃源_腾蛇_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "腾蛇关卡列表页",
            "腾蛇关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 青龙
    "桃源_青龙_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "青龙关卡列表页",
            "青龙关卡1难度选择页",
            "青龙1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "桃源_青龙_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "青龙关卡列表页",
            "青龙关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 白虎
    "桃源_白虎_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "白虎关卡列表页",
            "白虎关卡1难度选择页",
            "白虎1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "桃源_白虎_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "白虎关卡列表页",
            "白虎关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 朱雀
    "桃源_朱雀_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "朱雀关卡列表页",
            "朱雀关卡1难度选择页",
            "朱雀1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "桃源_朱雀_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "朱雀关卡列表页",
            "朱雀关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 玄武
    "桃源_玄武_关卡1_难度4": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "玄武关卡列表页",
            "玄武关卡1难度选择页",
            "玄武1_4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "桃源_玄武_关卡2_难度5": {
        "路径": [
            "主界面",
            "契约类别页",
            "桃源副本列表页",
            "玄武关卡列表页",
            "玄武关卡2难度选择页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 光神眠
    "神眠_光_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "光神眠关卡列表页",
            "光神眠关卡1难度选择页",
            "光神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_光_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "光神眠关卡列表页",
            "光神眠关卡2难度选择页",
            "光神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 暗神眠
    "神眠_暗_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "暗神眠关卡列表页",
            "暗神眠关卡1难度选择页",
            "暗神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_暗_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "暗神眠关卡列表页",
            "暗神眠关卡2难度选择页",
            "暗神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 地神眠
    "神眠_地_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "地神眠关卡列表页",
            "地神眠关卡1难度选择页",
            "地神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_地_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "地神眠关卡列表页",
            "地神眠关卡2难度选择页",
            "地神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 水神眠
    "神眠_水_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "水神眠关卡列表页",
            "水神眠关卡1难度选择页",
            "水神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_水_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "水神眠关卡列表页",
            "水神眠关卡2难度选择页",
            "水神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 火神眠
    "神眠_火_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "火神眠关卡列表页",
            "火神眠关卡1难度选择页",
            "火神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_火_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "火神眠关卡列表页",
            "火神眠关卡2难度选择页",
            "火神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 风神眠
    "神眠_风_关卡1_难度3": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "风神眠关卡列表页",
            "风神眠关卡1难度选择页",
            "风神眠1_3详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    "神眠_风_关卡2_难度7": {
        "路径": [
            "主界面",
            "契约类别页",
            "神眠副本列表页",
            "风神眠关卡列表页",
            "风神眠关卡2难度选择页",
            "风神眠2_7详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },
    # =========================================
    # 战令
    "战令一键领取": {
        "路径": [
            "主界面",
            {"坐标": "战令", "次数": 3, "间隔": 0.5},
            {"等图": "战令界面标识.png"},
            {"坐标序列": "战令按钮顺序", "次数": 3, "间隔": 1},
            {"图像按钮": "返回主界面.png", "等图": "出击.png", "重试": 3},
            "主界面",
        ],
        "扫荡页": None,
        "退出按钮": None,
    },
    # =========================================
    # 邮件
    "邮件一键领取": {
        "路径": [
            "主界面",
            {"坐标": "邮件", "次数": 3, "间隔": 0.5},
            {"坐标": "邮件一键领取", "次数": 3, "间隔": 1},
            {"图像按钮": "返回主界面.png", "等图": "出击.png", "重试": 3},
            "主界面",
        ],
        "扫荡页": None,
        "退出按钮": None,
    },
    # =========================================
    # 任务
    "任务一键领取": {
        "路径": [
            "主界面",
            {"坐标": "任务", "次数": 1, "间隔": 0.5},
            {"坐标": "任务一键领取", "次数": 3, "间隔": 0.5},
            {"图像按钮": "返回主界面.png", "等图": "出击.png", "重试": 3},
            "主界面",
        ],
        "扫荡页": None,
        "退出按钮": None,
    },
    # =========================================
    # 手记
    "手记一键领取": {
        "路径": [
            "主界面",
            {"坐标": "手记", "次数": 3, "间隔": 0.5},
            {"坐标": "手记一键领取", "次数": 3, "间隔": 0.5},
            {"图像按钮": "返回主界面.png", "等图": "出击.png", "重试": 3},
            "主界面",
        ],
        "扫荡页": None,
        "退出按钮": None,
    },
    # =========================================
    # 联机
    "联机战斗连战": {
        "路径": [
            "主界面",
            {"图像按钮": "联机.png", "等图": "联机_自动战斗.png", "重试": 3},
            {"图像按钮": "联机_自动战斗.png", "重试": 3},
            {"坐标": "联机自动战斗次数设置", "次数": 1, "间隔": 0.5},
            {"按键": "backspace", "次数": 6, "间隔": 0.1},
            {"输入": "次数"},
            {"图像按钮": "联机_开始自动战斗.png", "重试": 3},
            {"等待连战结束": "连战状态标识.png", "超时": 60},
            {"图像按钮": "返回主界面.png", "等图": "出击.png", "重试": 3},
            "主界面",
        ],
        "扫荡页": None,
        "退出按钮": None,
    },
    # =========================================
    # 角色经验
    "角色经验4":{
        "路径": [
            "主界面",
            "素材类别页",
            "角色回响经验列表页",
            "角色经验4详情页",
            "扫荡确认弹窗",
        ],
        "扫荡页": "扫荡结算页",
        "退出按钮": "桃源_扫荡后确定.png",
    },

}

扫荡配置 = {
    "单次超时": 60,
    "轮询间隔": 0.5,
    "页面超时": 45,
    "轮询快": 0.3,
    "点击后等待": 0.3,
    # ===== 缓存配置 =====
    "缓存文件": os.path.join(脚本目录, "cache.json"),
    "启用缓存": True,
    "最大点击重试": 3,
    "任务间隔": 1.0,
}# ============================================================
坐标按钮表 = {
    # 示例：
    "任务": [604, 698],
    "任务一键领取": [1012, 43],
    "邮件": [549, 44],
    "邮件一键领取": [1243, 30],
    "手记": [352, 701],
    "手记一键领取": [1163, 79],
    "战令": [1196, 93],
    "战令2": [141, 298],
    "战令3": [138, 394],
    "战令一键领取": [1247, 61],
    "战令任务": [1241, 726],
    "战令周任务": [1093, 162],
    "战令奖励": [1033, 720],
    "联机自动战斗次数设置": [938, 412],#此处单机后手动输入数字
    "回复AP关闭":[1248, 100],
}
# ============================================================
# 战令按钮顺序
# ============================================================
战令按钮顺序 = [
    "战令任务",
    "战令一键领取",
    "战令周任务",
    "战令一键领取",
    "战令奖励",
    "战令一键领取",
    "战令2",
    "战令任务",
    "战令一键领取",
    "战令周任务",
    "战令一键领取",
    "战令奖励",
    "战令一键领取",
    "战令3",
    "战令任务",
    "战令一键领取",
    "战令周任务",
    "战令一键领取",
    "战令奖励",
    "战令一键领取",
]
战令配置 = {
    "进入按钮": "战令",
    "界面标识": "战令界面标识.png",
    "返回按钮": "返回主界面.png",
    "点击次数": 3,
    "点击间隔": 1,
}